In [225]:
#importación de librerías

import numpy as np
import pandas as pd

pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [226]:
# abrir csv

df1 = pd.read_csv("files/Customer Flight Activity.csv", index_col = 0)
df1.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [227]:
df1.tail()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
999902,2018,12,0,0,0,0,0.0,0,0
999911,2018,12,0,0,0,0,0.0,0,0
999940,2018,12,3,0,3,1233,123.0,0,0
999982,2018,12,0,0,0,0,0.0,0,0
999986,2018,12,0,0,0,0,0.0,0,0

In [228]:
df1.columns

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [229]:
#número de filas
df1.shape[0]

405624

In [230]:
columnas1 = df1.select_dtypes(include =["int", "float"]).columns
columnas1

#confirmar que todas las columnas son numéricas

Index(['Year', 'Month', 'Flights Booked', 'Flights with Companions',
       'Total Flights', 'Distance', 'Points Accumulated', 'Points Redeemed',
       'Dollar Cost Points Redeemed'],
      dtype='object')

In [231]:
df1.info()

# "Points Accumulated" a lo mejor convertir en int; Year Month, a lo mejor convertir en fecha

<class 'pandas.core.frame.DataFrame'>
Int64Index: 405624 entries, 100018 to 999986
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Year                         405624 non-null  int64
 1   Month                        405624 non-null  int64
 2   Flights Booked               405624 non-null  int64
 3   Flights with Companions      405624 non-null  int64
 4   Total Flights                405624 non-null  int64
 5   Distance                     405624 non-null  int64
 6   Points Accumulated           405624 non-null  float64
 7   Points Redeemed              405624 non-null  int64
 8   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(8)
memory usage: 30.9 MB

In [232]:
df1["Points Accumulated"]

#si lo veo necesario, este puede convertirse a int

Loyalty Number
100018    152.0
100102    203.0
100140    120.0
100214      0.0
100272      0.0
          ...
999902      0.0
999911      0.0
999940    123.0
999982      0.0
999986      0.0
Name: Points Accumulated, Length: 405624, dtype: float64

In [233]:
# cambiar nombre de las columnas quitando espacio, porque si no, no puedo utilizar .loc
df1.columns = df1.columns.str.replace(" ", "_")
df1.columns

Index(['Year', 'Month', 'Flights_Booked', 'Flights_with_Companions',
       'Total_Flights', 'Distance', 'Points_Accumulated', 'Points_Redeemed',
       'Dollar_Cost_Points_Redeemed'],
      dtype='object')

In [234]:
df1.isnull().sum()

# buscando valores nulos

Year                           0
Month                          0
Flights_Booked                 0
Flights_with_Companions        0
Total_Flights                  0
Distance                       0
Points_Accumulated             0
Points_Redeemed                0
Dollar_Cost_Points_Redeemed    0
dtype: int64

In [235]:
df1["Flights_Booked"].isnull()

df1["Points_Accumulated"].isnull()

#comprobando en un par de columnas que no hay nulos

Loyalty Number
100018    False
100102    False
100140    False
100214    False
100272    False
          ...
999902    False
999911    False
999940    False
999982    False
999986    False
Name: Points_Accumulated, Length: 405624, dtype: bool

In [236]:
df1.duplicated().sum()

228705

In [237]:
df1[df1.duplicated()].sample(10)

,Year,Month,Flights_Booked,Flights_with_Companions,Total_Flights,Distance,Points_Accumulated,Points_Redeemed,Dollar_Cost_Points_Redeemed
Loyalty Number,,,,,,,,,
223380,2017,8,0,0,0,0,0.0,0,0
809587,2018,9,10,4,14,3458,345.0,0,0
519213,2018,9,0,0,0,0,0.0,0,0
834799,2017,10,0,0,0,0,0.0,0,0
558040,2018,12,0,0,0,0,0.0,0,0
168727,2018,5,0,0,0,0,0.0,0,0
700286,2017,8,0,0,0,0,0.0,0,0
173531,2017,10,0,0,0,0,0.0,0,0
663270,2017,11,5,0,5,1140,114.0,0,0
111646,2017,1,0,0,0,0,0.0,0,0

In [238]:
df2 = pd.read_csv("files/Customer Loyalty History.csv", index_col = 0)
df2.head()

#abrir segundo csv

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [239]:
#explorar segundo csv
df2.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [240]:
df2.shape[0]

16737

In [241]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16737 entries, 480934 to 652627
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             16737 non-null  object
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(2), object(9)
memory usage: 2.0+ MB

In [242]:
# cambiar nombre de las columnas quitando espacio, porque si no, no puedo utilizar .loc
df2.columns = df2.columns.str.replace(" ", "_")
df2.columns

Index(['Country', 'Province', 'City', 'Postal_Code', 'Gender', 'Education',
       'Salary', 'Marital_Status', 'Loyalty_Card', 'CLV', 'Enrollment_Type',
       'Enrollment_Year', 'Enrollment_Month', 'Cancellation_Year',
       'Cancellation_Month'],
      dtype='object')

In [243]:
df2["CLV"].sample(4)

Loyalty Number
717308     7712.44
108346     4854.75
503638     2659.71
567420    24980.23
Name: CLV, dtype: float64

In [244]:
df2["CLV"].unique()
df2["CLV"].value_counts()


#tratando de entender qué significa CLV; Customer Lifetime Value; si lo necesito posteriormente hay modos distintos de calcularlo

8564.77     13
13024.13    12
3808.12     12
2359.42     12
3731.50     12
            ..
16152.90     1
5204.65      1
5620.59      1
5205.02      1
61134.68     1
Name: CLV, Length: 7984, dtype: int64

In [245]:
df2["CLV"].describe()

count    16737.000000
mean      7988.896536
std       6860.982280
min       1898.010000
25%       3980.840000
50%       5780.180000
75%       8940.580000
max      83325.380000
Name: CLV, dtype: float64

In [246]:
""" limpiezas necesarias loyalty card, loyalty number ¿es igual?

si da tiempo convertir en función de limpieza
nulos, duplicados al final después de unir los csv"""

' limpiezas necesarias loyalty card, loyalty number ¿es igual?\n\nsi da tiempo convertir en función de limpieza\nnulos, duplicados al final después de unir los csv'

In [247]:
#convertir las Enrollement Year y Month  en float para unificar
df2["Enrollment_Year"].astype("int64", errors = "ignore")
df2["Enrollment_Month"].astype("int64", errors = "ignore")

df2["Enrollment_Year"]
df2["Enrollment_Month"]

Loyalty Number
480934     2
549612     3
429460     7
608370     2
530508    10
          ..
823768    12
680886     9
776187     3
906428     4
652627    12
Name: Enrollment_Month, Length: 16737, dtype: int64

In [248]:
#Cancellation Year y Month también a duplicados, con errors="ignore" porque tiene muchos nulos

df2["Cancellation_Year"] = df2["Cancellation_Year"].astype('Int64', errors="ignore")
df2["Cancellation_Month"] = df2["Cancellation_Month"].astype('Int64', errors="ignore")

In [249]:
#gestión de nulos
df2.isnull().sum()

Country                   0
Province                  0
City                      0
Postal_Code               0
Gender                    0
Education                 0
Salary                 4238
Marital_Status            0
Loyalty_Card              0
CLV                       0
Enrollment_Type           0
Enrollment_Year           0
Enrollment_Month          0
Cancellation_Year     14670
Cancellation_Month    14670
dtype: int64

In [250]:
df2["Salary"].sample(10)

Loyalty Number
491513         NaN
714536     96019.0
229621     70678.0
945485     83703.0
615394     67071.0
614307     74303.0
627244     56886.0
853826    102878.0
653851         NaN
144514     49618.0
Name: Salary, dtype: float64

In [251]:
df2["Cancellation_Year"].unique()

<IntegerArray>
[<NA>, 2018, 2015, 2017, 2014, 2016, 2013]
Length: 7, dtype: Int64

In [252]:
filas_nan = df2.loc[df2["Cancellation_Year"].isna(), :]
filas_nan.head(10)

,Country,Province,City,Postal_Code,Gender,Education,Salary,Marital_Status,Loyalty_Card,CLV,Enrollment_Type,Enrollment_Year,Enrollment_Month,Cancellation_Year,Cancellation_Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,<NA>,<NA>
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,<NA>,<NA>
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,<NA>,<NA>
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,<NA>,<NA>
193662,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,51124.0,Married,Star,3844.57,Standard,2012,5,<NA>,<NA>
927943,Canada,Ontario,Toronto,P5S 6R4,Female,College,NaN,Single,Star,3857.95,Standard,2014,6,<NA>,<NA>
188893,Canada,Ontario,Trenton,K8V 4B2,Male,Bachelor,100159.0,Married,Star,3861.49,Standard,2016,12,<NA>,<NA>
852392,Canada,Quebec,Montreal,H2Y 2W2,Female,Bachelor,100159.0,Married,Star,3861.49,Standard,2015,5,<NA>,<NA>
866307,Canada,Ontario,Toronto,M8Y 4K8,Male,Bachelor,100159.0,Married,Star,3861.49,Standard,2016,10,<NA>,<NA>
932823,Canada,British Columbia,Vancouver,V6E 3D9,Female,Bachelor,66444.0,Married,Star,3863.31,Standard,2015,3,<NA>,<NA>

In [253]:
"""# un nuevo DataFrame sin los duplicados
df1_sin_duplicados = df.drop_duplicates()
df1_sin_duplicados.shape[0]"""

'# un nuevo DataFrame sin los duplicados\ndf1_sin_duplicados = df.drop_duplicates()\ndf1_sin_duplicados.shape[0]'

In [254]:
#df2.loc[df2["City"] == "Toronto"]